# 리스트 기초

# ===========================================================
#  컬렉션 자료형: ( list ), ( tuple ), ( dictionary ), ( set )
# ===========================================================

# ===========================================================
#  리스트 (list): 여러 객체를 '순서가 있는' 컬렉션으로 묶어 저장하는 '변경 가능'한 자료형
#  리스트 특징
#  1. ( mutable, 변경 가능 ) -> 문자열과의 차이점
#  2. ( iterable, 반복 가능 )
#  3. ( sequence, 인덱싱, 슬라이싱 가능 )
#  4. ( 중복 가능 )
# ===========================================================

# 리스트 생성
a = []
b = list() # 생성자(constructor) 사용
print(type(a), type(b)) # <class 'list'>

a = [1, 3.14, True, "Python"]
print(a)

s = "python"
# print([s]) # 이러면 ["python"] 됨!
print(list(s))


# ===========================================================
# 1. 리스트는 mutable하다. (변경 가능)
# ===========================================================


print("-"*10)

print(a)
print(id(a))
a[0] = 10
a[-1] = "C"
print(a)
print(id(a)) # id 같음!

print("-"*10)


# ===========================================================
# 2. 리스트는 iterable하다. (반복 가능)
# ===========================================================

print("-"*10)

# 리스트 순회
for data in a:
    print(data)

for i, data in enumerate(a):
    print(i, data)

print("-"*10)

# ===========================================================
# 3. 리스트는 sequence 자료형이다. (인덱싱, 슬라이싱 가능)
# ===========================================================

print("-"*10)

# 인덱싱

print(a[0])
print(a[-1])


# 슬라이싱

# 앞에서 2개
print(a[:2])
# 중간에서 2개
print(a[1:3])
# 거꾸로 출력
print(a[::-1])

print("-"*10)

# ===========================================================
# 4. 리스트는 중복을 허용한다. (같은 값을 여러번 담을 수 있음)
# ===========================================================

print("-"*10)

a = [10, 10, 10]
print(a)

print("-"*10)

# ===========================================================
#  파이썬 내장 함수
# ===========================================================

a = [3, 4, 1, 5, 2]


# 리스트 합치기


# "+" 연산은 문자열과 동일하게 새로운 리스트 객체를 만듦
# 원본을 바꾸려면 리스트 메소드 사용하기


# 리스트 반복하기


# 멤버십 연산자