# 집합 기초

# ===========================================================
#  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형
#  집합의 특징
#  1. ( mutable, 변경 가능 ) == list, dict
#  2. ( iterable, 반복 가능 ) == list, tuple, dict
#  3. ( sequence X, 인덱싱과 슬라이싱 불가 ) '=. dict
#  4. ( 중복 허용 안함 )
# ===========================================================

# 집합 생성
# a = {} # 이러면 타입이 dict가 됨
a = set()
print(type(a)) # <class 'set'>

print({3, 3, 3, 2, 2, 1})
print({100, 8, 30})

# 딕셔너리처럼 해시 테이블에 모듈러 연산을 적용하여 저장하는데, 이 때문에 8로 나눈 나머지를 기준으로 오름차순으로 정렬되어 나옴!


# ===========================================================
# 1. 집합은 mutable하다. (변경 가능)
# ===========================================================

a = {1, 2, 3}
a.update({3, 4})
print(a) # 중복된 값 무시하고 {1, 2, 3, 4}

a.update("Hello, World!") # 문자열도 가능!
print(a)
a.update([5, 6]) # 리스트도 가능! --> iterable 객체!
print(a)

a.remove(3)
print(a)
# a.remove(7) # 값 없으면 KeyError


# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회
for i in a:
    print(i)


# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================

# a[0] = 10 # __setitem__ 없음!


# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {10, 10, 20, 20, 30}
print(s) # 자동으로 중복 제거!


# ===========================================================
#  파이썬 내장 함수
# ===========================================================

print(len(s))
print(sum(s))
print(min(s))
print(max(s))
print(sorted(s)) # 리턴값은 리스트이기 때문에 sorted() 가능!


# 집합 합치기
s2 = {40, 50}
# print(s + s2) # TypeError; set끼리 연산은 불가능!
print(s.union(s2)) # update()와 동일하지만 새로운 set을 만들어 리턴

# 집합 반복하기
# print(s * 2) # TypeError; 곱하기 연산 불가능, 의미도 없음..

# 멤버십 연산자
print(10 in s) # True
print(1 in s) # False